---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.BentFabricStraightWiresLocation.Right
enum: Autodesk.Revit.DB.Structure.BentFabricStraightWiresLocation
source: html/366283e6-dcb6-d863-13e0-32937d93a499.htm
---
# Autodesk.Revit.DB.Structure.BentFabricStraightWiresLocation.Right

Fabric straight wires are located on the right side of bent wires.